export const ADMIN_TEXTS = {
	ONLY_ADMINS: "⛔ Только для администраторов",
	UPLOAD_XLSX: "📤 Загрузить XLSX",
	MANAGE_USERS: "👨‍💼 Управление пользователями",
	// MANAGE_USERS: "👨👥 Управление пользователями",
	UPLOAD_XLSX_MESSAGE: "📎 *Загрузить XLSX*\n\n" +
		"Пожалуйста, отправьте файл в формате `.xlsx`.\n" +
		"После загрузки я обработаю данные.",
	MANAGE_USERS_MESSAGE: "👨‍💼 *Управление пользователями*\n\nВыберите действие:",
	ADD_USER_BTN: "➕ Добавить пользователя",
	ADD_USER_TEXT: "🗑 Введи ID пользователя, которого нужно добавить:",
	DELETE_USER_BTN: "➖ Удалить пользователя",
  EDIT_USER_BTN: "🤖🔧Редактировать пользователя",
	DELETE_USER_TEXT: "🗑 Введи ID пользователя, которого нужно удалить:",
	USERS_LIST: "📋 Список пользователей",
};