export const CATALOG_TEXTS = {
	UNAVAILABLE:
		"Каталог товаров временно недоступен. Пожалуйста, попробуйте еще раз чуть позже или свяжитесь с менеджером.",

	EMPTY_CATALOG:
		"Здесь пока нет товаров. Пожалуйста, попробуйте еще раз чуть позже или свяжитесь с менеджером.",

	CHOOSE_CATEGORY_First: "Сначала выберите категорию",

	LOADING: "⏳ Загружаю товары...",

	CHOOSE_BRAND: "👇 Выберите производителя",

	CHOOSE_CATEGORY: "👇 Выберите категорию товаров бренда ",

	DOWNLOAD_CATALOG: "📥 Скачать прайслист",

	ALL: "📦 Все",

	NOT_ITEMS_FOR_DOWNLOAD: "❌ Нет товаров для выгрузки",

	PRICE_LIST: "📦 Прайс-лист",

	SIM_LEGEND: `📋 <b>Условные обозначения:</b>\n\n📲 — SIM + eSIM\n📶 — eSIM\n☎️ — Dual SIM\n✅ Active — Активированное устройство`,
};
