export enum USERS_ERRORS {
	FAILED_LOAD = "Failed to load users.json",
	USER_EXISTS = "User already exists",
	USER_NOT_FOUND = "User not found",
	USER_NOT_FOUND_MESSAGE = "❌ Пользователь не найден",
  ID_NUMBER = "❌ ID должен быть числом",
  DELETE_MYSELF = "❌ Нельзя удалить самого себя",
  CANT_DELETE_USER = "❌ Не удалось удалить пользователя",
  EDIT_MYSELF = "❌ Нельзя редактировать самого себя",
  ONLY_ADMIN = "❌ Только администратор может редактировать пользователей",
}

export enum USERS_TEXTS {
  ENTER_ID_USER_DELETE = "🗑 Введи ID пользователя, которого нужно удалить:",
  DELETE_SUCCESSFUL = "✅ Пользователь успешно удалён",
  ENTER_ID_USER_EDIT = "🗑 Введи ID пользователя, которого нужно отредактировать:",
  EDIT_SUCCESSFUL = "✅ Пользователь успешно отредактирован",
}